-- INSERT INTO ΑΠΟΘΗΚΗ (ID, Πόλη, Οδός, Αριθμός, ΤΚ, Τηλέφωνο) VALUES (1, 'Αθήνα', 'Λεωφ.Αλεξάνδρας', '151', '17123', '2108847651');
-- INSERT INTO ΑΠΟΘΗΚΗ (ID, Πόλη, Οδός, Αριθμός, ΤΚ, Τηλέφωνο) VALUES (2, 'Θεσσαλονίκη', 'Τσιμισκή', '27', '53144', '2310776432');
-- INSERT INTO ΑΠΟΘΗΚΗ (ID, Πόλη, Οδός, Αριθμός, ΤΚ, Τηλέφωνο) VALUES (3, 'Θεσσαλονίκη', 'Εγνατία', '32', '54167', '2310884665');

-- INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
-- VALUES (1, 1, 1, 'Μία μεγάλη περιπέτεια', 2017, '978-3-16-148410-0', 17, 5);
-- INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
-- VALUES (2, 1, 1, 'Ένα μυστήριο καλοκαίρι', 2018, '455-2-32-183774-1', 22, 4);
-- INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
-- VALUES (3, 1, 1, 'Το μυστικό βουνό', 2019, '123-4-23-488574-2', 19, 7);
-- INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
-- VALUES (4, 2, 2, 'Η Άνοιξη', 2020, '872-7-14-432001-6', 13, 3);
INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
VALUES (5, 3, 2, 'Το μαγικό δωμάτιο', 2019, '303-5-11-277462-9', 25, 11);
INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
VALUES (6, 3, 3, 'Προγραμματισμός σε Python', 2019, '132-4-22-488574-6', 34, 16);
INSERT INTO ΒΙΒΛΙΟ (ID, IDαποθήκης, IDεκδοτικούΟίκου, Τίτλος, ΈτοςΈκδοσης, ISBN, ΤιμήΠώλησης, Ποσότητα) 
VALUES (7, 3, 3, 'Προγραμματισμός σε Java', 2020, '726-3-44-288374-5', 42, 21);

-- INSERT INTO ΕΚΔΟΤΙΚΟΣ_ΟΙΚΟΣ (ID, Όνομα, Διεύθυνση, URL) VALUES (1, 'Εκδόσεις Πάπυρος', '25ης Μαρτίου 124 - Μαρούσι - Αθήνα', 'www.ekdpapyros.gr');
-- INSERT INTO ΕΚΔΟΤΙΚΟΣ_ΟΙΚΟΣ (ID, Όνομα, Διεύθυνση, URL) VALUES (2, 'Εκδόσεις Αναγνώστης', 'Εγνατία 85 - Θεσσαλονίκη', 'www.anagnostis.gr');
-- INSERT INTO ΕΚΔΟΤΙΚΟΣ_ΟΙΚΟΣ (ID, Όνομα, Διεύθυνση, URL) VALUES (3, 'IEEE-USA', 'NW. Suite 700 Washington DC 20036-4910 USA', 'www.ieee.org');

INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (1, 1, '2020-04-20');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (2, 2, '2020-03-14');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (3, 1, '2020-08-15');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (4, 3, '2020-10-17');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (5, 4, '2020-11-22');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (6, 4, '2020-12-18');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (7, 5, '2021-01-08');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (8, 6, '2021-01-16');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (9, 7, '2020-09-23');
INSERT INTO ΚΑΛΑΘΙ_ΑΓΟΡΩΝ (ID, IDπελάτη, Ημερομηνία) VALUES (10, 7, '2020-10-15');

-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (1, 'Γεώργιος', 'Καραγιαννίδης', 'Χρήστος', 'Αθήνα', 'Πατησίων', '175', '17121', 'test1@gmail.com');
-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (2, 'Αντώνιος', 'Παπαπέτρου', 'Κωνσταντίνος', 'Αθήνα', 'Κηφισίας', '221', '18164', 'test2@gmail.com');
-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (3, 'Ελένη', 'Δημητρίου', 'Ιωάννης', 'Θεσσαλονίκη', 'Τσιμισκή', '123', '54723', 'test3@gmail.com');
-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (4, 'Μαρία', 'Αντωνίου', 'Παύλος', 'Θεσσαλονίκη', 'Εγνατία', '28', '54276', 'test4@gmail.com');
-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (5, 'Ιωάννης', 'Παπαδόπουλος', 'Νικόλαος', 'Θεσσαλονίκη', 'Εγνατία', '97', '54167', 'test5@gmail.com');
-- INSERT INTO ΠΕΛΑΤΗΣ (ID, Όνομα, Επώνυμο, ΌνομαΠατρός, Πόλη, Οδός, Αριθμός, ΤΚ, e_mail) VALUES (6, 'Νικόλαος', 'Χρήστου', 'Δημήτριος', 'Θεσσαλονίκη', 'Παπαναστασίου', '34', '54376', 'test6@gmail.com');

INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (1, 2, 22);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (1, 1, 17);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (1, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (1, 4, 13);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (1, 5, 25);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (3, 7, 42);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (3, 6, 34);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (2, 2, 22);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (2, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (2, 4, 13);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (2, 5, 25);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (4, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (4, 6, 34);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (4, 7, 42);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (5, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (5, 4, 13);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (6, 5, 25);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (6, 6, 34);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (6, 7, 42);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (7, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (7, 5, 25);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (8, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (8, 1, 17);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (9, 3, 19);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (10, 2, 22);
INSERT INTO ΠΕΡΙΕΧΟΜΕΝΑ_ΚΑΛΑΘΙΟΥ (IDκαλαθιού, IDβιβλίου, Τιμή) VALUES (10, 3, 19);

-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (1, 'Paulo Coelho', 'testmail1@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (2, 'Παπαδόπουλος Χρήστος', 'testmail2@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (3, 'Παπαγεωργίου Αλέξανδρος', 'testmail3@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (4, 'Μαρία Ιωαννίδου', 'testmail4@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (5, 'Ιωάννα Πετρίδου', 'testmail5@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (6, 'John Smith', 'testmail6@gmail.com');
-- INSERT INTO ΣΥΓΓΡΑΦΕΑΣ (ID, Ονοματεπώνυμο, e_mail) VALUES (7, 'Ian Robert', 'testmail7@gmail.com');

INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (1, 2);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (1, 4);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (2, 3);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (2, 5);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (2, 4);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (3, 1);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (4, 2);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (4, 4);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (5, 5);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (5, 4);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (6, 6);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (7, 6);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (6, 7);
INSERT INTO ΣΥΓΓΡΑΦΕΙΣ_ΒΙΒΛΙΟΥ (IDβιβλίου, IDσυγγραφέα) VALUES (7, 7);

-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΕΚΔΟΤΙΚΩΝ_ΟΙΚΩΝ (IDεκδοτικούΟίκου, Τηλέφωνο) VALUES (1, '2103664532');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΕΚΔΟΤΙΚΩΝ_ΟΙΚΩΝ (IDεκδοτικούΟίκου, Τηλέφωνο) VALUES (1, '2108836746');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΕΚΔΟΤΙΚΩΝ_ΟΙΚΩΝ (IDεκδοτικούΟίκου, Τηλέφωνο) VALUES (2, '2310274636');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΕΚΔΟΤΙΚΩΝ_ΟΙΚΩΝ (IDεκδοτικούΟίκου, Τηλέφωνο) VALUES (2, '2310274635');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΕΚΔΟΤΙΚΩΝ_ΟΙΚΩΝ (IDεκδοτικούΟίκου, Τηλέφωνο) VALUES (3, '0010029938742646');

-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (1, '2107768894');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (2, '2103645867');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (2, '2108366485');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (3, '2310446227');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (4, '2310884775');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (4, '2310838474');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (5, '2310993884');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (6, '2310873746');
-- INSERT INTO ΤΗΛΕΦΩΝΑ_ΠΕΛΑΤΩΝ (IDπελάτη, Τηλέφωνο) VALUES (7, '2310437736');